# -*- org-confirm-babel-evaluate: nil -*-
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:3
#+LANGUAGE: en-us
#+HTML_DOCTYPE: html5
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <style>blockquote p:last-child, div.figure p {margin: 0;}</style>
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,12pt]
#+LATEX_HEADER: \usepackage[english]{babel}
#+LATEX_HEADER: \renewcommand{\familydefault}{\sfdefault}
#+LATEX_HEADER: \usepackage{helvet}
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER: \usepackage{tabularx}
#+LATEX_HEADER: \usepackage{float}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{titlesec}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage[document]{ragged2e}
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage{sectsty}
#+LATEX_HEADER: \titleformat*{\section}{\LARGE\bfseries}
#+LATEX_HEADER: \titleformat*{\subsection}{\Large\bfseries}
#+LATEX_HEADER: \titleformat*{\subsubsection}{\large\bfseries}
#+LATEX_HEADER: \titleformat*{\paragraph}{\large\bfseries}
#+LATEX_HEADER: \titleformat*{\subparagraph}{\large\bfseries}
#+LATEX_HEADER: \renewcommand{\baselinestretch}{1.2}
#+LATEX_HEADER: \definecolor{light_grey}{RGB}{51,51,51}
#+LATEX_HEADER: \definecolor{bright_grey}{RGB}{249,249,249}
#+LATEX_HEADER: \definecolor{python_blue}{RGB}{41,128,185}
#+LATEX_HEADER: \hypersetup{colorlinks=true, urlcolor=python_blue, linkcolor=python_blue, citecolor=red}
#+LATEX_HEADER: \tolerance=1
#+LATEX_HEADER: \emergencystretch=\maxdimen
#+LATEX_HEADER: \hyphenpenalty=10000
#+LATEX_HEADER: \hbadness=10000
#+LATEX_HEADER: \makeatletter
#+LATEX_HEADER: \makeatother
#+LATEX_HEADER: \lstset{
#+LATEX_HEADER:   xleftmargin=0.5cm,frame=tlbr,framesep=4pt,framerule=0pt,
#+LATEX_HEADER:   columns=fullflexible,
#+LATEX_HEADER:   backgroundcolor=\color{white},
#+LATEX_HEADER:   basicstyle=\footnotesize\ttfamily,
#+LATEX_HEADER:   breakatwhitespace=false,
#+LATEX_HEADER:   breaklines=true,
#+LATEX_HEADER:   frame=single,
#+LATEX_HEADER:   keepspaces=true,
#+LATEX_HEADER:   rulecolor=\color{black},
#+LATEX_HEADER:   showspaces=false,
#+LATEX_HEADER:   showstringspaces=false,
#+LATEX_HEADER:   showtabs=false,
#+LATEX_HEADER:   stepnumber=2,
#+LATEX_HEADER:   tabsize=2,
#+LATEX_HEADER: }
#+LATEX_HEADER: \DeclareUnicodeCharacter{202F}{ }
#+LATEX: \frenchspacing
#+LATEX: \raggedright
#+TITLE: Guide: estimate heritability of disorder stratified by year of birth
#+AUTHOR: Richard Zetterberg <richard.zetterberg@regionh.dk>
#+PROPERTY: header-args:R :session *R* :tangle yes :shebang "#!/usr/bin/env Rscript"

#+LATEX: \clearpage

#+BEGIN_SRC R :exports none :tangle no
devtools::load_all(".")
source("./tests/utils.R")
#+END_SRC

#+RESULTS:

This is a guide for making the method in [[./guide.org]["estimate heritability of disorder"]] more robust
by adding year of birth stratification.

All code shown in this guide have been written to [[./guide-yob.R][this R file]], so that you don't have
to copy all code snippets manually.

We'll use all the same arguments and code as the previous guide, but we will start changing
the guide at the part where we produce the risk estimates.

We start by importing all the needed libraries:

#+BEGIN_SRC R :exports code :eval no
library(data.table)
library(dplyr)
library(dtplyr)
library(readr)
library(IbpRiskEstimations)
#+END_SRC

#+BEGIN_SRC R :exports none
study_period_start <- as.Date("1981-01-01")
study_period_end   <- as.Date("2016-12-31")

icd_codes_regexp <- "^F20|^295[^7]9"
earliest_onset_age <- 10

born_at_start <- as.Date("1981-01-01")
born_at_end   <- as.Date("1996-01-01")

relationship_kind <- "FS"
#+END_SRC

#+RESULTS:
: FS

#+BEGIN_SRC R :eval no :exports code
tte <- read_csv("./tte_SCZ_FS.csv") |> as.data.table()
#+END_SRC

#+BEGIN_SRC R :exports results :results output :tangle no
set.seed(6)
n_count <- 100000

tte <- generate_random_tte(n_count)
tte <- generate_failure(tte, 20, 10)
tte <- generate_diagnosed_relatives(tte, "diagnosed_relatives") |>
  select(-born_at_year, -dead_at_year) |>
  relocate(relatives, .after = failure_time) |>
  as.data.table()
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :exports both :results output
tte <- tte |>
  filter(
    born_at >= born_at_start,
    born_at <= born_at_end
  )
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :exports both :results output
print(tte)
#+END_SRC

#+RESULTS:
#+begin_example
       person_id    born_at failure_status failure_time relatives diagnosed_relatives
    1:        12 1995-12-01              0           29         3                   0
    2:        14 1981-11-29              0           43         1                   0
    3:        16 1985-12-24              0           39         1                   1
    4:        19 1993-02-14              0           31         1                   0
    5:        20 1993-08-20              0           31         4                   0
   ---
20249:     99990 1995-10-07              0           29         3                   0
20250:     99992 1984-01-09              1           38         0                   0
20251:     99997 1994-06-04              0           30         0                   0
20252:     99999 1992-07-21              0           32         0                   0
20253:    100000 1993-09-03              1            1         2                   2
#+end_example

* Analysis

** Risk estimates

#+BEGIN_SRC R :exports none
cif_analysis <- CumulativeIncidenceAnalysis$new()
#+END_SRC

#+RESULTS:

In this updated version of the pipeline, we are going to use the same two cohorts
as the original version:

1. All individuals
2. Individuals with at least 1 affected relative

In the original version of the pipeline, the results looked something like this:

#+BEGIN_EXAMPLE
    time   estimate     variance        l95        u95 cases             cohort
 1:   10 0.05769079 2.261547e-04 0.02821599 0.08716559     1 affected_relatives
 2:   11 0.06229293 2.451218e-04 0.03160702 0.09297885     2 affected_relatives
27:   10 0.02128324 2.227802e-05 0.01203229 0.03053419     1                all
28:   11 0.02250389 2.371205e-05 0.01295984 0.03204794     3                all
#+END_EXAMPLE

Where you have risk estimates separated on the two cohorts. In this updated version,
the results will look something like this:

#+BEGIN_EXAMPLE
    time   estimate     variance        l95        u95 cases             cohort  born_at_year
 1:   10 0.05769079 2.261547e-04 0.02821599 0.08716559     1 affected_relatives          1960
 2:   11 0.06229293 2.451218e-04 0.03160702 0.09297885     2 affected_relatives          1960
27:   10 0.02128324 2.227802e-05 0.01203229 0.03053419     1                all          1960
28:   11 0.02250389 2.371205e-05 0.01295984 0.03204794     3                all          1960
 1:   10 0.05769079 2.261547e-04 0.02821599 0.08716559     1 affected_relatives          1961
 3:   12 0.06696774 2.645270e-04 0.03509033 0.09884516     3 affected_relatives          1961
27:   10 0.02128324 2.227802e-05 0.01203229 0.03053419     1                all          1961
29:   12 0.02497864 2.664947e-05 0.01486069 0.03509659     4                all          1961
 1:   10 0.05769079 2.261547e-04 0.02821599 0.08716559     1 affected_relatives          1962
 3:   12 0.06696774 2.645270e-04 0.03509033 0.09884516     3 affected_relatives          1962
27:   10 0.02128324 2.227802e-05 0.01203229 0.03053419     1                all          1962
29:   12 0.02497864 2.664947e-05 0.01486069 0.03509659     4                all          1962
#+END_EXAMPLE

Where you have risk estimates separated on the two cohorts and the year of birth.

To pull that of, we simply add a new column that contains the year of birth:

#+BEGIN_SRC R :exports code :results output
tte <- tte |>
  mutate(
    born_at_year = as.character(format(born_at, "%Y"))
  )
#+END_SRC

#+RESULTS:

And then like before, we create the two cohorts:

#+BEGIN_SRC R :exports code :results output
tte <- tte |>
  mutate(cohort = "all") |>
  union_all(
    tte |>
      filter(diagnosed_relatives > 0) |>
      mutate(cohort = "affected_relatives")
  )
#+END_SRC

#+RESULTS:

Now the survival data have the same amount of rows as before, but with one extra column added:

#+BEGIN_SRC R :exports both :results output
print(tte)
#+END_SRC

#+RESULTS:
#+begin_example
       person_id    born_at failure_status failure_time relatives diagnosed_relatives
    1:        12 1995-12-01              0           29         3                   0
    2:        14 1981-11-29              0           43         1                   0
    3:        16 1985-12-24              0           39         1                   1
    4:        19 1993-02-14              0           31         1                   0
    5:        20 1993-08-20              0           31         4                   0
   ---
24811:     99949 1994-04-13              1           21         7                   4
24812:     99973 1984-08-29              0           40         5                   2
24813:     99979 1995-07-21              0           29         3                   3
24814:     99981 1981-04-03              1           22         2                   2
24815:    100000 1993-09-03              1            1         2                   2
       born_at_year             cohort
    1:         1995                all
    2:         1981                all
    3:         1985                all
    4:         1993                all
    5:         1993                all
   ---
24811:         1994 affected_relatives
24812:         1984 affected_relatives
24813:         1995 affected_relatives
24814:         1981 affected_relatives
24815:         1993 affected_relatives
#+end_example

Now when we run the analysis, we supply *both* the ~affected_relatives~ column and the
~born_at_year~ column:

#+BEGIN_SRC R :exports code :results output
estimates <- cif_analysis$run(
  tte = tte,
  earliest_onset_age = earliest_onset_age,
  group_columns = list("born_at_year", "cohort")
)
#+END_SRC

#+RESULTS:

Now, you'll see that the estimates are grouped on all the possible permutations of the
two columns:

#+BEGIN_SRC R :exports both :results output
print(estimates)
#+END_SRC

#+RESULTS:
#+begin_example
     time    estimate     variance           l95         u95 cases born_at_year
  1:    2 0.003333333 1.111111e-05 -0.0031998799 0.009866547     1         1981
  2:    3 0.006666667 2.214802e-05 -0.0025572547 0.015890588     2         1981
  3:    6 0.010000000 3.311074e-05 -0.0012780117 0.021278012     3         1981
  4:    7 0.013333333 4.399926e-05  0.0003325125 0.026334154     4         1981
  5:    9 0.016666667 5.481358e-05  0.0021558393 0.031177494     6         1981
 ---
888:   25 0.076978940 5.163896e-05  0.0628945891 0.091063290   110         1995
889:   26 0.081336238 5.430445e-05  0.0668929592 0.095779517   115         1995
890:   27 0.084967320 5.650462e-05  0.0702343581 0.099700282   120         1995
891:   28 0.088598402 5.868563e-05  0.0735837945 0.103613010   123         1995
892:   29 0.090777052 5.998505e-05  0.0755971275 0.105956976   152         1995
                 cohort
  1: affected_relatives
  2: affected_relatives
  3: affected_relatives
  4: affected_relatives
  5: affected_relatives
 ---
888:                all
889:                all
890:                all
891:                all
892:                all
#+end_example

** Heritability

After producing the risk estimates, we can calculate the heritability.
To do that we need a dataset that contains the last risk estimate
(highest value of ~time~ column) for each year of birth, that exists
in both cohorts:

#+BEGIN_SRC R :exports both :results output
cohort1 <- estimates |> filter(cohort == "all")
cohort2 <- estimates |> filter(cohort == "affected_relatives")
#+END_SRC

#+RESULTS:

Then to make sure we only use risk estimates that exists in both cohorts, we
join the two cohorts using an inner join. An inner join will only keep rows that
have matches in both datasets, all other rows are removed. Since the results are
stratified by year of birth, we need to make sure the risk estimates exists in both
cohorts, for all years:

#+BEGIN_SRC R :exports both :results output
combined <- cohort1 |>
  inner_join(cohort2, by = join_by(time, born_at_year)) |>
  rename(
    cohort1_estimates = estimate.x,
    cohort1_cases     = cases.x,
    cohort2_estimates = estimate.y,
    cohort2_cases     = cases.y
  ) |>
  select(time, born_at_year, cohort1_estimates, cohort1_cases, cohort2_estimates, cohort2_cases)
#+END_SRC

#+RESULTS:

Now we have a combined dataset where each row represents risk estimates from both cohorts.
Since we are only interested in the last risk estimate in each year of birth, we need to
sort the risk estimates so that the last risk estimate is first and then pick the first
risk estimate per year of birth:

#+BEGIN_SRC R :exports both :results output
combined <- combined |>
  group_by(born_at_year) |>
  arrange(desc(time)) |>
  filter(row_number() == 1) |>
  as.data.table()
#+END_SRC

#+RESULTS:

If we order the dataset by year of birth, we can see that we have the latest
risk estimate for each year with the estimates and amount of cases for
both cohorts:

#+BEGIN_SRC R :exports both :results output
print(combined |> arrange(born_at_year))
#+END_SRC

#+RESULTS:
#+begin_example
    time born_at_year cohort1_estimates cohort1_cases cohort2_estimates cohort2_cases
 1:   43         1981        0.10639881           141         0.2300000            70
 2:   42         1982        0.09763101           131         0.1829653            56
 3:   41         1983        0.09335325           125         0.1621622            48
 4:   40         1984        0.09816850           134         0.1488673            44
 5:   39         1985        0.09417040           122         0.1593220            43
 6:   38         1986        0.09747292           141         0.1672026            56
 7:   37         1987        0.09351988           126         0.1861314            50
 8:   36         1988        0.09940209           137         0.1931034            59
 9:   35         1989        0.10015773           136         0.1900000            64
10:   34         1990        0.08030888           115         0.1803279            58
11:   33         1991        0.08339483           127         0.1726619            55
12:   32         1992        0.09037472           134         0.1958763            64
13:   31         1993        0.08504176           136         0.1646341            61
14:   30         1994        0.09463277           146         0.1681416            60
15:   29         1995        0.09077705           152         0.1646341            62
#+end_example

Now we can simply run the heritability calculation by passing in the the estimate and
cases columns from the combined dataset along with the relationship kind:

#+BEGIN_SRC R :exports both :results output
h2_analysis <- HeritabilityAnalysis$new()

results <- h2_analysis$run(
  relationship_kind = relationship_kind,
  estimates         = combined
)
#+END_SRC

#+RESULTS:

And here's what the results look like:

#+BEGIN_SRC R :exports both :results output
print(results)
#+END_SRC

#+RESULTS:
#+begin_example
    time born_at_year cohort1_estimates cohort1_cases cohort2_estimates cohort2_cases
 1:   43         1981        0.10639881           141         0.2300000            70
 2:   42         1982        0.09763101           131         0.1829653            56
 3:   41         1983        0.09335325           125         0.1621622            48
 4:   40         1984        0.09816850           134         0.1488673            44
 5:   39         1985        0.09417040           122         0.1593220            43
 6:   38         1986        0.09747292           141         0.1672026            56
 7:   37         1987        0.09351988           126         0.1861314            50
 8:   36         1988        0.09940209           137         0.1931034            59
 9:   35         1989        0.10015773           136         0.1900000            64
10:   34         1990        0.08030888           115         0.1803279            58
11:   33         1991        0.08339483           127         0.1726619            55
12:   32         1992        0.09037472           134         0.1958763            64
13:   31         1993        0.08504176           136         0.1646341            61
14:   30         1994        0.09463277           146         0.1681416            60
15:   29         1995        0.09077705           152         0.1646341            62
           h2         se        l95       u95
 1: 0.6228291 0.10027808 0.42628407 0.8193742
 2: 0.4661971 0.10368062 0.26298304 0.6694111
 3: 0.3924781 0.10736769 0.18203745 0.6029188
 4: 0.2950882 0.11128449 0.07697062 0.5132058
 5: 0.3733100 0.11268029 0.15245663 0.5941634
 6: 0.3920222 0.10166302 0.19276270 0.5912817
 7: 0.5051446 0.10772429 0.29400497 0.7162842
 8: 0.5022918 0.10253288 0.30132735 0.7032563
 9: 0.4838149 0.09924184 0.28930091 0.6783289
10: 0.5596683 0.09644018 0.37064554 0.7486911
11: 0.5050839 0.09839437 0.31223092 0.6979368
12: 0.5673837 0.09624308 0.37874728 0.7560201
13: 0.4566355 0.09369268 0.27299785 0.6402732
14: 0.4138707 0.09755592 0.22266110 0.6050803
15: 0.4205854 0.09424478 0.23586560 0.6053051
#+end_example

Since the results are stratified by year of birth, we need to run a meta
analysis to get a single value:

#+BEGIN_SRC R :exports both :results output
meta <- h2_analysis$run_meta(results)

print(meta)
#+END_SRC

#+RESULTS:
:    fixed_meta   fixed_se fixed_l95 fixed_u95 rand_meta    rand_se rand_l95  rand_u95
: 1:  0.4680483 0.02609397 0.4169041 0.5191924 0.4664169 0.03419329 0.399398 0.5334357

There are actually two results one for the fixed effects model and one for the random effects model.

The next logical step is to use the [[../genetic-correlation/guide.org][estimate genetic correlation between two disorders]]-pipeline,
since that pipeline builds upon the results of this pipeline.
